In [3]:
import pandas as pd #creation of series scalar values

In [4]:
s = pd.Series([1,2,3,4])

In [5]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
s1 = pd.Series(["john","abhi","anand","bobby"],index=[3,5,6,8])

In [7]:
s1

3     john
5     abhi
6    anand
8    bobby
dtype: object

In [8]:
s2 = pd.Series([3,4],index=["jai","tom"])

In [9]:
s2

jai    3
tom    4
dtype: int64

In [10]:
import numpy as np
import pandas as pd  #creation of series from numpy arrays

In [11]:
arr1 = np.array(["jan","feb","mar"])
sr = pd.Series(arr1)
print(sr)

0    jan
1    feb
2    mar
dtype: object

In [12]:
arr2 = np.array([1,2,3])
ser2 = pd.Series(arr2,index=["jan","feb","mar"])
print(ser2)

jan    1
feb    2
mar    3
dtype: int32

In [13]:
dic1 = {'john':2002,'Abhinav':2004,'krish':2005}
print(dic1)

{'john': 2002, 'Abhinav': 2004, 'krish': 2005}

In [14]:
series3 = pd.Series(dic1)
print(series3)

john       2002
Abhinav    2004
krish      2005
dtype: int64

KeyError: 0

In [111]:
ar1 = np.array([1,3,4,5]) #positional index
sr2 = pd.Series(ar1)
sr2[2]

4

In [112]:
ar2 = np.array([1,3,4,5]) #labelled index and multiple access
sr4 = pd.Series(ar2,index=['jan','tom','elon','kalam'])
sr4[['tom','elon']]

tom     3
elon    4
dtype: int32

In [113]:
s1 = np.array(['a','b','c','d']) #slicing
slc = pd.Series(s1,index=['us','uk','ind','china'])
slc[1:3]

uk     b
ind    c
dtype: object

In [114]:
slc['us':'china'] #slicing for including all data

us       a
uk       b
ind      c
china    d
dtype: object

In [115]:
import numpy as np
series1 = pd.Series(np.arange(10,16,1),
index=['a,'b','c','d','e','f'])
print(series1)

SyntaxError: cannot mix bytes and nonbytes literals (Temp/ipykernel_648/2339414498.py, line 3)

In [116]:
sp=pd.Series([1,2,3,5]) #methods of series
sd=pd.Series([78,89,33,12])
sp*sd

0     78
1    178
2     99
3     60
dtype: int64

In [117]:
import numpy as np  #dataframe using numpy
a1=np.array([1,2,3,5])
a2=np.array([33,44,56,77])
a3=np.array([36,77])
d=pd.DataFrame(a1)
d

   0
0  1
1  2
2  3
3  5

In [118]:
d3=pd.DataFrame([a1,a2,a3])
d3

    0   1     2     3
0   1   2   3.0   5.0
1  33  44  56.0  77.0
2  36  77   NaN   NaN

In [119]:
import pandas as pd
df=pd.DataFrame() #empty dataframe
df

Empty DataFrame
Columns: []
Index: []

In [120]:
dics={'state':['AndhraPradesh','UttarPradesh','Tamilnadu','Telangana'],  #creating dataframe using dictionary 
      'capitals':['amaravathi','lucknow','chennai','hyd'],
      'chiefministers':['jagan','yogi','stalin','kcr']}
dfd=pd.DataFrame(dics)
dfd

           state    capitals chiefministers
0  AndhraPradesh  amaravathi          jagan
1   UttarPradesh     lucknow           yogi
2      Tamilnadu     chennai         stalin
3      Telangana         hyd            kcr

In [121]:
seriesA=pd.Series([1,2,3,4]) #using series
seriesB=pd.Series([72,23,43,64])
hg=pd.DataFrame([seriesA,seriesB])
hg

    0   1   2   3
0   1   2   3   4
1  72  23  43  64

In [122]:
dfd['party']=['YCP','BJP','Dmk','Trs'] #operations [adding new column] if the col already exists then it'll update
dfd

           state    capitals chiefministers party
0  AndhraPradesh  amaravathi          jagan   YCP
1   UttarPradesh     lucknow           yogi   BJP
2      Tamilnadu     chennai         stalin   Dmk
3      Telangana         hyd            kcr   Trs

In [123]:
dfd.loc[4]=['West Bengal','Kolkata','Mamatha','TMC'] #adding new row
dfd

           state    capitals chiefministers party
0  AndhraPradesh  amaravathi          jagan   YCP
1   UttarPradesh     lucknow           yogi   BJP
2      Tamilnadu     chennai         stalin   Dmk
3      Telangana         hyd            kcr   Trs
4    West Bengal     Kolkata        Mamatha   TMC

In [124]:
dfd=dfd.drop('party',axis=1) # to remove column,the parameter of axis is assigned the valued 1
dfd

           state    capitals chiefministers
0  AndhraPradesh  amaravathi          jagan
1   UttarPradesh     lucknow           yogi
2      Tamilnadu     chennai         stalin
3      Telangana         hyd            kcr
4    West Bengal     Kolkata        Mamatha

In [125]:
dfd=dfd.drop(3,axis=0) # to remove row,the parameter of axis is assigned the valued 0
dfd

           state    capitals chiefministers
0  AndhraPradesh  amaravathi          jagan
1   UttarPradesh     lucknow           yogi
2      Tamilnadu     chennai         stalin
4    West Bengal     Kolkata        Mamatha

In [126]:
dfd=dfd.rename({'capitals':'HQ','chiefministers':'cm'},axis='columns') #to change the columns names
dfd

           state          HQ       cm
0  AndhraPradesh  amaravathi    jagan
1   UttarPradesh     lucknow     yogi
2      Tamilnadu     chennai   stalin
4    West Bengal     Kolkata  Mamatha

In [127]:
dfd=dfd.rename({0:'category1',1:'category2',2:'category3'},axis='index') #to change the rows[index] names
dfd

                   state          HQ       cm
category1  AndhraPradesh  amaravathi    jagan
category2   UttarPradesh     lucknow     yogi
category3      Tamilnadu     chennai   stalin
4            West Bengal     Kolkata  Mamatha

In [128]:
j=np.array([1,2,3,4])
df=pd.DataFrame(j)   #label based index
df

   0
0  1
1  2
2  3
3  4

In [129]:
df.loc[1]

0    2
Name: 1, dtype: int32

In [130]:
dfd.loc['category1':'category3'] #slicing

                   state          HQ      cm
category1  AndhraPradesh  amaravathi   jagan
category2   UttarPradesh     lucknow    yogi
category3      Tamilnadu     chennai  stalin

In [131]:
df=pd.DataFrame([[1,2,3,4],[4,5,6]],columns=['c1','c2','c3','c4'],index=['r1','r2'])  #joining
df

    c1  c2  c3   c4
r1   1   2   3  4.0
r2   4   5   6  NaN

In [132]:
df2=pd.DataFrame([[5,7],[3,2]],columns=['c4','c6'],index=['r3','r4'])
df2

    c4  c6
r3   5   7
r4   3   2

In [133]:
df=df.append(df2)
df

     c1   c2   c3   c4   c6
r1  1.0  2.0  3.0  4.0  NaN
r2  4.0  5.0  6.0  NaN  NaN
r3  NaN  NaN  NaN  5.0  7.0
r4  NaN  NaN  NaN  3.0  2.0